Repository: biblibre/koha-plugin-patron-import
Catalog: documentation/locales/*/LC_MESSAGES/add-ons.po
Languages: fr

source: A patron-import add-on is simply a Koha plugin that implements one or more hooks called by the main plugin (patron-import).
fr: Un add-on est simplement un plugin Koha qui implémente un ou plusieurs hook(s) appelés par le plugin principal.

source: A add-on is used to handle specific cases that are not feasible by configuring the plugin like complex mappings or unusual data transformation.
fr: Un add-on est utilisé pour prendre en compte des cas spécifiques qui ne peuvent pas être configurés par la configuration du plugin comme les correspondances complexes ou les transformations de données non habituelles.

source: Create an add-on
fr: Créer un add-on

source: First, create the plugin’s directory. It should respect this structure: my-plugin-name/Koha/Plugin/Com/Biblibre/MyPluginName.pm.
fr: Premièrement, créer le dossier du plugin. Cela doit respecter la structure: my-plugin-name/Koha/Plugin/Com/Biblibre/MyPluginName.pm.

source: A good practice is to name the plugin base directory like `"koha-plugin-myplugin-patron-import"`.
fr: Une bonne pratique est de nommer dossier du plugin comme `"koha-plugin-myplugin-patron-import"`.

source: Create this directory on a place where Koha can access / read.
fr: Créer ce dossier à un endroit que Koha peut lire/accéder.

source: Your plugin must contain at least this code to be installed by the Koha plugin system: Here is a starter for a plugin named “Example”:
fr: Votre plugin doit contenir au minimum ce code afin qu'il soit installé par l'installation de plugin Koha: Ici le début d'un plugin nommé “Exemple”:

source: A hook is called multiple times during the import process. Each hook corresponds to a specific point in the import. See `“Available hooks”` section below to learn when they are called and how to implement them.
fr: Un hook est appelé plusieurs fois durant un import. Chaque hook correspond à un moment spécifique de l'import. Voir la section `“Hooks disponibles”` ci-dessous afin d'apprendre quand ils sont appelés et comment les implémenter.

source: To implement a hook add it where you want in the add-on package:
fr: Pour implémenter un hook, ajouter le dans l'add-on:

source: **Available hooks:**
fr: **Hooks disponibles:**

source: For authorized users, you can check the `Example add-on <https://git.biblibre.com/Add-on-patron-import/koha-plugin-example-patron-import/src/branch/master/Koha/Plugin/Com/Biblibre/Example.pm>`__.
fr: Pour les utilisateurs autorisés, vous pouvez regarder l'add-on d'exemple <https://git.biblibre.com/Add-on-patron-import/koha-plugin-example-patron-import/src/branch/master/Koha/Plugin/Com/Biblibre/Example.pm>`__.

source: Here is a list of available hooks and how they should be written.
fr: Ici sont listés les hooks disponibles et la manière dont ils doivent être manipulés.

source: This hook is called just after the field and value mappings are processed.
fr: Ce hook est appelé juste après les correspondances faites au travers du mapping paramétré.

source: ``$borrower`` is the futur Koha patron.
fr: ``$borrower`` est le futur adhérent Koha.

source: Called before the patron is updated in Koha.
fr: Appelé avant qu'un adhérent soit mis à jour dans Koha.

source: ``$patron`` is the incoming patron
fr: ``$patron`` est l'adhérent entrant

source: ``$extended_attributes`` contains the incoming patron extended attributes
fr: ``$extended_attributes`` contient les attributes étendus de l'adhérent entrant

source: ``$stored_patron`` is the current Koha patron
fr: ``$stored_patron`` est l'adhérent courant

source: ``$stored_extended_attributes`` contains the current patron extended attributes
fr: ``$stored_extended_attributes`` contient les attributs étendus de l'adhérent courant

source: Called after the patron is updated in Koha.
fr: Appelé après qu'un adhérent soit mis à jour dans Koha.

source: ``$borrowernumber`` is the updated borrowernumber.
fr: ``$borrowernumber`` est le borrowernumber de l'adhérent mis à jour.

source: Called before the patron is created in Koha.
fr: Appelé avant que l'adhérent ne soit crée dans Koha.

source: Called after the patron is created in Koha.
fr: Appelé après que l'adhérent eut été crée dans Koha.

source: Called to define if the patron should be ignored by the import process.
fr: Appelé pour définir si l'adhérent doit être ignorés durant l'import.

source: ``$patron`` id the mapped incoming patron.
fr: ``$patron`` id de l'adhérent entrant correspondant.

source: Called to define an additionnal condition after matchingpoint result.
fr: Appelé pour définir une condition additionnelle après le résultat du dédoublonnage.

source: ``$patron`` is the mapped incoming patron. ``$borrowernumber`` is the borrowernumber found (or not) by matchingpoint
fr: ``$patron`` est l'adhérent correspondant entrant. ``$borrowernumber`` est le borrowernumber trouvé (ou non) suite au dédoublonnage

source: Now you created your add-on, you will have to install it.
fr: Maintenant que vous avez crée votre add-on, vous devez l'installer.

source: Installing steps:
fr: Etapes d'installation:

source: Clone or upload your add-on on the server
fr: Cloner ou mettre à jour l'add-on sur le serveur

source: Add it in the Koha configuration file
fr: Ajouter le dans le fichier de configuration Koha

source: Launch the plugin installer
fr: Lancer l'installeur de plugin

source: Enable the add-on
fr: Activer l'add-on

source: Link the add-on to a configured import
fr: Lier l'add-on à un import configuré

source: Place your add-ons directory somewhere Koha can access it
fr: Placer vos dossiers d'add-ons de façon à ce que Koha puisse accéder à ceux-çi

source: Edit your koha-conf.xml and add a ``<pluginsdir>`` tag inside the ``<config>`` one.
fr: Editer le fichier koha-conf.xml et ajouter un élement ``<pluginsdir>``

source: At this point you might need to restart some Koha services and clear cache.
fr: A présent, redémarrer les services Koha et nettoyer le cache.

source: Go the Koha source code and run this command:
fr: Aller dans le code de Koha et lancer la commande:

source: You should see this when your plugin is successfully installed:
fr: Vous devriez voir ceci lorsque votre plugin s'est correctement installé:

source: Before being used by Koha or other plugins the add-on must be enabled.
fr: Avant d'être utilisé par Koha ou par d'autres plugins l'add-on doit être activé.

source: Go to the Koha plugins home page (`cgi-bin/koha/plugins/plugins-home.pl`), find your add-on, click on ``Actions`` and the ``Enable`` button.
fr: Aller à la page d'accueil des plugins (`cgi-bin/koha/plugins/plugins-home.pl`), trouver l'add-on, cliquer sur ``Actions`` et sur le bouton ``Enable``.

source: Once your add-on is installed and enabled, you should see it when editing an import configuration.
fr: Une fois l'add-on installé et activé, il sera visible dans la configuration d'un import.

source: Just select the add-on(s) you want be used with the import.
fr: Sélectionner juste le(s) add-on(s) a utiliser avec l'import.
