Repository: biblibre/koha-plugin-patron-import
Catalog: documentation/locales/*/LC_MESSAGES/create_import.po
Languages: fr

source: Create new import
fr: Créer un nouvel import

source: Once the plugin has been installed, you can access its configuration from the Koha plugins home page.
fr: Une fois le plugin installé, accédez à sa configuration depuis la page d'accueil des plugins Koha.

source: Find the Patron import plugin in the table and click on ``Action->configure``. Here you can add one or more imports and view existing imports. Click on `"New import"` and fill in the form as required.
fr: Trouver le plugin Patron import dans la table et cliquer sur ``Action->configure``. Ici vous pourrez ajouter un ou plusieurs imports et voir les existants. Cliquer sur `"New import"` remplir le formulaire.

source: The Import name can be anything you like. There are 2 options for the type of feed: CSV or LDAP server. All other form elements are described.
fr: Le nom de l'import peut être ce que vous voulez. Il y a 2 options pour le type de source: CSV ou LDAP server. Tous les autres éléments sont indiqués.

source: To create new import, click on the `"New import"` plugin configuration page and complete the form:
fr: Pour créer un nouvel import, cliquer sur `"New import"` sur la page de configuration et compléter le formulaire.

source: **Import name**: Name of your import. Can be anything you like.
fr: **Import name**: Nom de l'import. Peut être ce que vous voulez.

source: **Flow type**: Type of data source. This can be a CSV or LDAP server.
fr: **Flow type**: Type de données source. Cela peut provenir d'un CSV ou d'un serveur LDAP.

source: **Create only**: If this box is checked, only a new user is added. No update.
fr: **Create only**: Si cette case est cochée, seulement les nouveaux utilisateurs sont crées, il n'y a pas de mise à jour.

source: **Auto Cardnumber**: Let the plugin create cardnumber for your patrons.
fr: **Auto Cardnumber**: Laisser le plugin créer les numéros de carte pour les adhérents.

source: **Send email to new patrons**: In the same way as Koha's embedded functionality for CSV imports, send an email based on the “WELCOME” template
fr: **Send email to new patrons**: A la manière de la fonctionnalité incluse dans Koha sur les imports CSV, envoyer un mail d'après le modèle “WELCOME”

source: **Clear reports and logs older than**: Number of days for which import reports are stored in the database. They are then deleted.
fr: **Clear reports and logs older than**: Nombre de jours de stockage des rapports dans la base de données.Ensuite ils seront supprimés.

source: CSV Settings
fr: Réglages CSV

source: **CSV path**: Path of CSV file to be imported. If it is empty, you must specify it as a parameter of the import script.
fr: **CSV path**: Chemin du fichier CSV a importé. S'il est vide, vous devez le spécifier comme paramètre du script d'import.

source: **Binary**: CSV option, see https://metacpan.org/pod/Text::CSV#binary
fr: **Binary**: option CSV, voir https://metacpan.org/pod/Text::CSV#binary

source: **End of line**: CSV option, see https://metacpan.org/pod/Text::CSV#eol
fr: **End of line**: Option CSV, voir https://metacpan.org/pod/Text::CSV#eol

source: **Char separator**: CSV option, see https://metacpan.org/pod/Text::CSV#sep_char
fr: **Char separator**: Option CSV, voir https://metacpan.org/pod/Text::CSV#sep_char

source: **Quote char**: CSV option, see https://metacpan.org/pod/Text::CSV#quote_char
fr: **Quote char**: Option CSV, voir https://metacpan.org/pod/Text::CSV#quote_char

source: **Empty is undef**: CSV option, see https://metacpan.org/pod/Text::CSV#empty_is_undef
fr: **Empty is undef**: Option CSV, voir https://metacpan.org/pod/Text::CSV#empty_is_undef

source: **Allow loose quotes**: CSV option, see https://metacpan.org/pod/Text::CSV#allow_loose_quotes
fr: **Allow loose quotes**: Option CSV, voir https://metacpan.org/pod/Text::CSV#allow_loose_quotes

source: Configuration handler
fr: Gestionnaire de configuration

source: You can export your configuration by clicking on the `"Export this configuration"` link. When you click on it, an entry appears, allowing you to choose the name of your `YAML` file.
fr: Vous pouvez exporter votre configuration en cliquant sur le lien `"Export this configuration"`. Quand vous cliquez dessus, une entrée vous invitant à choisir le nom de votre fichier `YAML` file apparaît.

source: You can also apply a configuration from a `YAML` (well-structured) file. On an existing import profile or directly with a new one.
fr: Vous pouvez aussi appliquer une configuration depuis un fichier `YAML` (bien structuré). sur un import existant ou sur un nouvel import directement.

source: Configuration Handler
fr: Gestionnaire de configuration
