Repository: biblibre/koha-plugin-patron-import
Catalog: documentation/locales/*/LC_MESSAGES/define_mappings.po
Languages: fr

source: Define mappings
fr: Définitions des correspondances

source: Mapping definitions is a very important feature of this plugin, as it determines how the data will be interpreted.
fr: Les correspondances sont une fonctionnalité essentielles de ce plugin puisque ce sont elles qui vont déterminer les données à traiter.

source: When you :ref:`created an import <create_import>`, you choose a *flow type* which is the source type of your data. Whichever type of source you import from, Patron-import will transform the source data into tabular data. This tabular data is referred to here as **incoming data**. Mappings are applied to the incoming data to create a Koha patron.
fr: Quand vous :ref:`créez un import <create_import>`, vous choisissez une *source de données. Peu importe la source utilisée, le plugin transformera les données sources en tableau de données. Ce tableau sera référencé comme étant les **données entrantes**. Les correspondances seront appliquées sur ces données pour créer un adhérent Koha.

source: This data transformation involves several optional steps:
fr: Cette transformation des données implique plusieurs étapes facultatives:

source: Fields mappings
fr: Correspondances des champs

source: Field mapping consists in moving the incoming data field into the koha patron field. Basically, this means that we will tell Pattern-import: "move the incoming data to the Koha field related to the patron".
fr: La correspondance des champs consiste à ajouter les données entrantes dans les champs Koha de l'adhérent. Cela signifie simplement que nous disons au plugin: "ajoute cette donnée dans ce champ Koha de l'adhérent".

source: Accessing mappings page
fr: Accès à la page des correspondances

source: Once you've :ref:`created an import <create_import>`, you can view it on the plugin configuration home page. On this page, click on the “mappings” link.
fr: Une fois que vous avez :ref:`crée un import <create_import>`, vous pouvez le voir sur la page d'accueil du plugin. Sur cette page, cliquez sur le lien “mappings”.

source: Add new field mapping
fr: Ajouter une nouvelle correspondance de champ

source: To add a field match, enter the name of a field in the left-hand part of the table (Source field column). Which must match an existing field in your source data, and select the koha field to match. Click on `add` button.
fr: Pour ajouter une correspondance, saisir le nom du champ de la source à gauche et sélectionnez le champ Koha à faire correspondre. Cliquer sur le bouton `add`.

source: Field mapping
fr: Correspondance de champ

source: Implicit mappings
fr: Correspondances implicites

source: If the name of your source field matches the name of a koha field, you don't need to explicitly create the match. The plugin will do this implicitly. For example, ``surname => surname`` is not required except if you have to apply value mapping or transformation plugin.
fr: Si le nom du champ de la source correspond exactement au champ Koha, vous n'avez pas besoin de créer explicitement la correspondance. Le plugin le fera implicitement. Par exemple, ``surname => surname`` n'est pas requis, sauf si vous ajoutez une correspondance de valeur ou une transformation.

source: You can use tokens in the source field column. Tokens are source field names surrounded by square brackets. They are used for conditional matches or concatenation.
fr: Vous pouvez utiliser des tokens pour le nom de vos champs source. Les tokens sont les noms entourés de chevrons. Ils sont utilisés pour des correspondances conditionnelles ou des concaténations.

source: Concatenation with comma
fr: Concaténation avec une virgule

source: 'num' and 'street' will be concatenated with ‘,’ as separator and mapped in the address koha field.
fr: 'num' et 'street' seront concaténés avec ‘,’ comme séparateur et correspondront au champ Koha de l'adresse.

source: Concatenation with pipe
fr: Concaténation avec pipe

source: Email will be mapped if it is not empty. If it is, id will be.
fr: L'email sera pris en compte s'il n'est pas vide. S'il l'est ce sera l'id qui le sera à sa place.

source: Value mappings
fr: Correspondances de valeur

source: Value mappings allow you to transform source field values into other values during the mapping process. Value matches are configured for each field mapping.
fr: Les correspondances de valeur vous permettent de transformer les valeurs des champs entrants vers une autre valeur durant la prise en compte des correspondances. Les correspondances de valeur sont configurables pour chaque correspondance de champ.

source: Add new value mapping
fr: Ajouter une nouvelle correspondance de valeur

source: In the field mapping page, click on `value mappings` button of the corresponding field mapping. In the table, add as any value mappings as you like and save.
fr: Dans la page de correspondance des champs, cliquer sur le bouton `value mappings` du champ correspondant. Dans le tableau ajouter autant de correspondances de valeur que souhaité et sauvegarder.

source: The value on the left (input value) is the incoming value of your source field. The value on the right (output value) is the replacement value.
fr: La valeur d'entrée (sur la gauche) correspond à la valeur entrante de la source La valeur de sortie (sur la droite) correspond à la valeur de remplacement.

source: A good example for value mappings is the transformation of category codes to match valid koha categorycodes.
fr: Un bon exemple de correspondances de valeur est la transformation des category codes pour correspondre à un categorycode Koha valide.

source: In the example above, for the field mapping in destination to categorycode, “Adult” will tranformed to “ADU”, “Young” to “YNG” and “Librarian” to “LIB”
fr: Dans l'exemple ici, le champ correspondant pour 'categorycode', “Adult” sera transformé en “ADU”, “Young” en “YNG” et “Librarian” en “LIB”

source: If none of this rules match
fr: Si aucune de ces règles ne fonctionnent

source: Under the value mapping table you can define a “fallback” value. This value will only be set if none of the existing rules match the field. Not to be confused with the :ref:`default values <default_values>` which are applied if the field is empty or non-existent.
fr: Sous le tableau de correspondances vous pouvez définir une valeur de “secours”. Cette valeur sera seulement définie si aucune des règles existantes ne correspond au champ. A ne pas confondre avec :ref:`les valeurs par défaut <default_values>` qui sont appliquées si le champ est vide ou n'existe pas.

source: No rule match
fr: Aucune règle ne correspond

source: Transformation plugins
fr: Plugins de transformation

source: Tranformation plugins are a set of data filters available to apply frequent changes to incoming data. They are applied just after the field mapping process and before the value mapping.
fr: des changements fréquents sur les données entrantes. Ils sont appliqués juste après les correspondances de champ et avant les correspondances de valeur.

source: The mapping order is:
fr: L'ordre des correspondance est:

source: Field mapping (source field => target field)
fr: Correspondance du champ (champ source => champ cible)

source: **Transformation plugins**
fr: **Plugins de transformation**

source: Value mapping
fr: Correspondance de valeur

source: Default value
fr: Valeur par défaut

source: You can choose none, one or more transformation plugins. To apply them, click on the `"Transformation plugins"` button in the corresponding mapping on the field mapping page.
fr: Vous pouvez choisir aucun, un ou plusieurs plugin de transformation. Pour les appliquer, cliquez sur le bouton `"Transformation plugins"` dans la page de correspondances des champs.

source: In the transformation plugins page, select the ones you wish to use.
fr: Dans la page des plugins de transformation, sélectionnez ceux que vous souhaitez utiliser.

source: Transformation plugin
fr: Plugin de transformation

source: Matching point
fr: Dédoublonnage

source: When importing a patron, the import process needs to know whether it is a new Koha patron (create) or an existing one (update) in Koha that needs to be modified.
fr: Lorsqu'un adhérent est importé, le processus d'import doit reconnaître s'il s'agit d'un nouvel adhérent (création) ou d'un adhérent existant (mise à jour) dans Koha qui nécessite d'être modifié.

source: To determine that, we have to create a matching point. A matching point is one or more field(s) that will be searched in Koha patron database. If it corresponds to a Koha patron, it will be updated with the incoming data, otherwise a new patron will be created.
fr: Pour déterminer ceci, Nous devons créer un dédoublonnage. Le point de dédoublonnage correspond à un ou plusieurs champs qui seront chercher dans la base de données adhérent de Koha. Si l'adhérent est trouvé il sera mis à jour avec les données entrantes, sinon il sera crée.

source: Note that all fields in the match point are requested using an “AND” operator. Not “OR”. This means that all fields must match, not just one.
fr: A noter que tous les champs du point de dédoublonnage requièrent un opérateur “ET”. Non “OU”. Ce qui signifie que tous les champs doivent correspond, pas seulement un.

source: Add a field to the matching point by selecting it from the list below the field mapping table and clicking on `"add"`.
fr: Ajouter un champ de dédoublonnage en le sélectionnant depuis la liste sous le tableau de corespondances et en cliquant sur le bouton `"add"`.
