Repository: biblibre/koha-plugin-patron-import
Catalog: documentation/locales/*/LC_MESSAGES/deletions.po
Languages: fr

source: Deletions
fr: Suppressions

source: Deletion rules are a set of fields/values defining which patrons are to be deleted in Koha.
fr: Les règles de suppressions sont un ensemble de champs/valeurs qui définit les patrons à supprimer de Koha.

source: Several conditions must be met to delete a patron:
fr: Plusieurs conditions doivent être réunies pour supprimer un adhérent:

source: Entire rule fields must have been matched the incoming data
fr: La règle doit correspondre en entier aux données entrantes

source: Incoming data must have been associated with a corresponding patron in Koha with regard to the `matching point`
fr: Les données entrantes doivent être associées à un adhérent Koha (trouvé par dédoublonnage)

source: Koha's target patron must not have any due charges
fr: L'adhérent cible ne doit pas avoir de dettes

source: Koha's target patron must not have any due checkouts
fr: L'adhérent cible ne doit pas avoir de prêts dus

source: Create a rule
fr: Créer une règle

source: Type a rule name and click `"Add"` button.
fr: Saisir un nom de règle et cliquer sur le bouton `"Add"`.

source: Add rule
fr: Ajouter une règle

source: Add fields
fr: Ajouter les champs

source: Select a field, entrer a value and click on the `"Add"` button.
fr: Sélectionner un champ, saisir une valeur et cliquer sur le bouton `"Add"`.

source: Add field
fr: Ajouter un champ
