Repository: biblibre/koha-plugin-patron-import
Catalog: documentation/locales/*/LC_MESSAGES/exclusions.po
Languages: fr

source: Exclusion rules can be used to define certain incoming patrons to be ignored.
fr: Les règles d'exclusion peuvent être utilisées pour définir les adhérents à ignorer.

source: A rule is a set of ``koha field => value``. All rule fields must match for the patron to be ignored.
fr: Une règle est un ensemble ``champ koha => valeur``. Toutes les règles doivent correspondre pour que le patron soit ignorés.

source: There is two rule types:
fr: Il y a deux types de règles:

source: **External**: match incoming data
fr: **Externe**: correspond à la donnée entrante

source: **Koha**: match Koha data (if a matching patron has been found).
fr: **Koha**: correspond à la donnée Koha (si le patron correspondant à été trouvé).

source: Create a rule
fr: Créer une règle

source: Enter a rule name, check whether you want a Koha rule or not and click on the `“Add”` button.
fr: Entrer le nom d'une règle, cocher ou non s'il s'agit d'une règle Koha et cliquer sur le bouton `“Add”`.

source: Add rule
fr: Ajouter une règle

source: Add fields
fr: Ajouter les champs

source: Select a field, entrer a value and click on `“Add”` button.
fr: Sélectionner un champ, entrer une valeur et cliquer sur le bouton `“Add”`.

source: Add field
fr: Ajouter un champ
