Repository: biblibre/koha-plugin-patron-import
Catalog: documentation/locales/*/LC_MESSAGES/extented_attributes.po
Languages: fr

source: Extended attributes
fr: Attributs étendus

source: This page is used to configure the behavior of each extended attribute of an existing patron when updating Koha patron.
fr: Cette page est utilisée pour configurer le comportement de chaque attribut étendu d'un adhérent Koha existant lors de sa mise à jour.

source: For each attribute, the behavior can be configured for differents situations:
fr: Pour chacun des attributs, le comportement peut être configuré de différentes façons:

source: If attribute is not repeatable, `"If many values"` select will be disabled.
fr: Si l'attribut est non répétable, le menu de sélection correspondant à `"If many values"` sera désactivé.

source: **Attribute is already defined with a value (only one)**
fr: **L'attribut est déjà défini avec une valeur (seulement une)**

source: `Do nothing`: Nothing is added or updated
fr: `Do nothing`: Rien ne sera ajouté ni mis à jour

source: `Update existing`: erase the existing value
fr: `Update existing`: remplacement de la valeur existante par la valeur entrante

source: **Attribute is already defined with more than one value (many)**
fr: **L'attribut est déjà défini avec plus d'une valeur (plusieurs)**

source: `Add if the values does not exists`: add new value from incoming data if it does not exists
fr: `Add if the values does not exists`: ajoute la nouvelle valeur entrante seulement si elle n'existe pas déjà.

source: When `"Update existing"` is selected, check that the incoming data matches the data you wish to replace, even if there are empty data or strings on the attribute.
fr: Lorsque `"Update existing"` est sélectionné, vérifier que la donnée entrante corresponde avec la donnée que vous souhaitez remplacer, même si la donnée est vide ou contient une chaîne vide.
