Repository: biblibre/koha-plugin-patron-import
Catalog: documentation/locales/*/LC_MESSAGES/index.po
Languages: fr

source: Contents
fr: Contenus

source: This plugin allows you to import patrons from a CSV file or by a LDAP server. Several mappings are available to define how to import the data.
fr: Ce plugin vous permet d'importer des adhérents depuis un fichier CSV ou un serveur LDAP. Vous pouvez définir de multiples correspondances sur la manière de traiter les informations entrantes pour importer les données.

source: The creation of add-ons is possible in order to extend the capabilities of the plugin during the import process.
fr: La création d'add-ons est possible afin d'étendre les capacités du plugin durant le processus d'import.

source: Before starting
fr: Avant de commencer

source: Before configuring the plugin, here are the basic (and **important**) elements that you need to prepare.
fr: Avant de configurer le plugin, vous trouverez ici les éléments de bases (et **importants**) que vous aurez besoin de préparer.

source: From which source ?
fr: Depuis quelle source ?

source: CSV or LDAP
fr: CSV ou LDAP

source: Ideally the csv should be encoded in utf8. The first line of the CSV must be the **column headers**.
fr: Idéalement les colonnes du csv doivent être encodées en utf8. La première ligne devraient contenir les **en-têtes**.

source: For a LDAP import, this additional informations are needed:
fr: Pour un import LDAP, vous aurez besoin de ces informations additionnelles:

source: **host and port** of the LDAP to be requested (IP address or URL)
fr: **l'hôte et le port** du serveur LDAP à requêter (adresse IP ou URL)

source: an authorized **account** (distinguished name) and **password** to read the directory if the anonymous bind is not allowed
fr: un **compte** autorisé et un **mot de passe** afin de lire le répertoire LDAP si les demandes anonymes ne sont pas autorisées.

source: a **search base** that is kind a sub-directory where the accounts to import are
fr: une **base de recherche** qui est une sorte de sous-répertoire où se trouve les comptes à importer

source: a **search filter** which allow the LDAP search to select only the wanted entries (optional)
fr: un **filtre de recherche** vous autorisant à effectuer une recherche LDAP pour sélectionner seulement les entrées souhaitées. (optionnel)

source: Field mappings
fr: Correspondances des champs

source: Create a mapping table between source fields and Koha fields.
fr: Créer une table de correspondances entre les champs sources et les champs Koha.

source: Source field
fr: Champ source

source: Koha field
fr: Champ Koha

source: If a source field is named the same way than the corresponding Koha field, the mapping is implicit and does not need to be defined in the configuration page. Unless the field value must correspond to a certain value or be transformed.
fr: Si un champ source est nommé exactement de la même manière que le champ Koha correspondant, la correspondance est implicite et vous n'avez pas besoin de le définir dans la configuration. Sauf si vous y appliquer des correspondances de valeur ou des transformations.

source: Value mappings
fr: Correspondances de valeur

source: Define the values that need to be transformed before being imported into Koha, and provide a transformation table for each field that requires it. Particularly for values that must correspond to an authorized value in Koha (e.g. categorycode, branchcode).
fr: Définissez les valeurs ayant besoin d'être transformées avant d'être importées dans Koha, et ajouter une transformation si le champ le nécessite. Particulièrement si les valeurs doivent correspondrent à des valeurs autorisées dans Koha (exemple: categorycode, branchcode).

source: The transformation process allows regular expressions such as “strict equals”, “starts with”, “contains”. For very specific treatments, an add-on must be drawn up.
fr: Le processus de transformation vous autorise à utiliser des expressions régulières comme 'strictement égal', 'commence par', 'contient'. Pour chaque autre traitement spécifique, un add-on doit être écrit.

source: Matching point
fr: Point de dédoublonnage

source: One or more fields to be used for deduplicate patrons. It is preferable to use unique fields (userid, cardnumber). Extended attributes can be used.
fr: Un ou plusieurs champs sont utilisés pour dédoublonner les adhérents.

source: Default values (optional but recommended)
fr: Valeurs par défaut (optionnelles mais recommandées)

source: Set default for certain fields if they are empty (or invalid for categorycode and branchcode). The definition of default values for **categorycode and branchcode** should be systematic.
fr: Définissez des valeurs par défaut pour certains champs s'ils sont vides (ou invalides pour categorycode et branchcode). La définition de valeurs par défaut pour les champs **categorycode et branchcode** devrait être systématique.

source: Automating
fr: Automatisation

source: Automation involves adding the import to a :ref:`cronjob <tools>`. This requires some important information:
fr: L'automatisation implique d'ajouter un :ref:`cronjob <tools>`. Ceci est important pour son fonctionnement:

source: **frequency** (each hour/day/week/month ?)
fr: **fréquence** (chaque heure/jour/semaine/mois ?)

source: **time** important to avoid processing during hours of use/opening
fr: **moment** important afin d'éviter les imports durant les heures d'utilisation

source: **where** the CSV file will be uploaded on the server (not for LDAP)
fr: **où** le fichier CSV sera envoyé sur le serveur (pas nécessaire pour le LDAP)

source: **naming** of CSV file may contain a date part which will be replaced by the current date during import
fr: **nommage** du fichier CSV qui pourrait contenir une partie dynamique pour la date

source: Pay attention to the import time. A file could be uploaded at 11:50 pm and imported at 00:30 am the day after.
fr: Prêtez attention à l'heure d'import. Un fichier peut être envoyé à 23h50 et importé à 00h30 le jour d'après.
